In [23]:
def salary_update(sal):
    newsal=0
    
    if sal <= 1500:
        newsal =  sal * 1.1
        
    elif sal <= 10000:
        newsal = sal*1.05
        
    elif sal <=20000:
        newsal = sal*1.025
        
    else:
        newsal = sal
        
    return newsal

In [24]:
salary_update(20000)

20500.0

In [25]:
import numpy as np 
import pandas as pd

In [26]:
df =  pd.read_csv('FinalOutput.csv')

In [27]:
df.head()

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.0,13200.0
1,2,Amar,2000,24000,Ops,2100.0,25200.0
2,3,Chitra,2000,24000,Admin,2100.0,25200.0
3,3,Chitra,2000,24000,Admin,2100.0,25200.0
4,4,Utkarsha,9878,118536,Ops,10371.9,124462.8

In [30]:
df[df.esal < 9878]

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
0,1,Prashant,1000,12000,HR,1100.0,13200.0
1,2,Amar,2000,24000,Ops,2100.0,25200.0
2,3,Chitra,2000,24000,Admin,2100.0,25200.0
3,3,Chitra,2000,24000,Admin,2100.0,25200.0

In [34]:
#emplyee names , salary and dept name detail 
df[df.esal>5000].iloc[:,1:4]

      ename  esal  yearlySalary
4  Utkarsha  9878        118536
5      Ajit  9999        119988

In [36]:
# recored of emply sal > 6500 and from ops dept 
df[(df.esal>6500)& (df.department=='Ops')]

,eid,ename,esal,yearlySalary,department,UpdatedSalary,UpdatedYearlySalary
4,4,Utkarsha,9878,118536,Ops,10371.9,124462.8

In [ ]:
df